In [77]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.neighbors import KNeighborsClassifier
from sklearn.svm import SVC
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier, GradientBoostingClassifier
import pickle

In [78]:
dataset = pd.read_csv("D:/Ds&Da/Project_start/recruitment_decision_tree.csv")

In [79]:
dataset

,Serial_no,Gender,Python_exp,Experience_Years,Education,Internship,Score,Salary * 10E4,Offer_History,Location,Recruitment_Status
0,1,Male,Yes,0.0,Graduate,No,5139,0.0,1.0,Urban,Y
1,2,Male,No,1.0,Graduate,No,4583,128.0,1.0,Rural,N
2,3,Male,No,0.0,Graduate,Yes,3000,66.0,1.0,Urban,Y
3,4,Male,No,0.0,Not Graduate,No,2583,120.0,1.0,Urban,Y
4,5,Male,Yes,0.0,Graduate,No,6000,141.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...
609,610,Female,Yes,0.0,Graduate,No,2900,71.0,1.0,Rural,Y
610,611,Male,No,3.0,Graduate,No,4106,40.0,1.0,Rural,Y
611,612,Male,No,1.0,Graduate,No,8072,253.0,1.0,Urban,Y
612,613,Male,No,2.0,Graduate,No,7583,187.0,1.0,Urban,Y
613,614,Female,Yes,0.0,Graduate,Yes,4583,133.0,0.0,Semiurban,N

In [80]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Serial_no           614 non-null    int64
 1   Gender              601 non-null    object
 2   Python_exp          611 non-null    object
 3   Experience_Years    599 non-null    float64
 4   Education           614 non-null    object
 5   Internship          582 non-null    object
 6   Score               614 non-null    int64
 7   Salary * 10E4       593 non-null    float64
 8   Offer_History       564 non-null    float64
 9   Location            614 non-null    object
 10  Recruitment_Status  614 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 52.9+ KB

In [81]:
dataset['Gender'].mode()

0    Male
Name: Gender, dtype: object

In [82]:
dataset['Gender'].fillna('Male', inplace=True)

In [83]:
dataset['Experience_Years'].fillna(dataset['Experience_Years'].mean(), inplace=True)

In [84]:
dataset['Python_exp'].mode()

0    No
Name: Python_exp, dtype: object

In [85]:
dataset['Python_exp'].fillna('No', inplace=True)

In [86]:
dataset['Internship'].mode()

0    No
Name: Internship, dtype: object

In [87]:
dataset['Internship'].fillna('No', inplace=True)

In [88]:
dataset['Salary * 10E4'].fillna(dataset['Salary * 10E4'].mean(), inplace=True)

In [89]:
dataset['Offer_History'].mode()

0    1.0
Name: Offer_History, dtype: float64

In [90]:
dataset['Offer_History'].fillna(1.0, inplace=True)

In [91]:
dataset.isna().sum()

Serial_no             0
Gender                0
Python_exp            0
Experience_Years      0
Education             0
Internship            0
Score                 0
Salary * 10E4         0
Offer_History         0
Location              0
Recruitment_Status    0
dtype: int64

In [92]:
def to_int_gen(word):
    word_dict = {'Male': 1,'Female':0}
    return word_dict[word]

In [93]:
dataset['Gender'] = dataset['Gender'].apply(lambda x : to_int_gen(x))

In [94]:
def to_int_pyexp(word):
    word_dict = {'Yes': 1,'No':0}
    return word_dict[word]

In [95]:
dataset['Python_exp']= dataset['Python_exp'].apply(lambda x : to_int_pyexp(x))

In [96]:
dataset['Education'].unique()

array(['Graduate', 'Not Graduate'], dtype=object)

In [97]:
def to_int_edu(word):
    word_dict = {'Graduate': 1,'Not Graduate':0}
    return word_dict[word]

In [98]:
dataset['Education']= dataset['Education'].apply(lambda x : to_int_edu(x))

In [99]:
def to_int_intern(word):
    word_dict = {'Yes': 1,'No':0}
    return word_dict[word]

In [100]:
dataset['Internship']= dataset['Internship'].apply(lambda x : to_int_intern(x))

In [101]:
dataset['Location'].unique()

array(['Urban', 'Rural', 'Semiurban'], dtype=object)

In [102]:
def to_int_locat(word):
    word_dict = {'Urban': 1,'Rural':2, 'Semiurban':3}
    return word_dict[word]

In [103]:
dataset['Location']= dataset['Location'].apply(lambda x : to_int_locat(x))

In [104]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Serial_no           614 non-null    int64
 1   Gender              614 non-null    int64
 2   Python_exp          614 non-null    int64
 3   Experience_Years    614 non-null    float64
 4   Education           614 non-null    int64
 5   Internship          614 non-null    int64
 6   Score               614 non-null    int64
 7   Salary * 10E4       614 non-null    float64
 8   Offer_History       614 non-null    float64
 9   Location            614 non-null    int64
 10  Recruitment_Status  614 non-null    object
dtypes: float64(3), int64(7), object(1)
memory usage: 52.9+ KB

In [120]:
X = dataset.drop(['Recruitment_Status','Serial_no'], axis=1)
X

,Gender,Python_exp,Experience_Years,Education,Internship,Score,Salary * 10E4,Offer_History,Location
0,1,1,0.0,1,0,5139,0.0,1.0,1
1,1,0,1.0,1,0,4583,128.0,1.0,2
2,1,0,0.0,1,1,3000,66.0,1.0,1
3,1,0,0.0,0,0,2583,120.0,1.0,1
4,1,1,0.0,1,0,6000,141.0,1.0,1
...,...,...,...,...,...,...,...,...,...
609,0,1,0.0,1,0,2900,71.0,1.0,2
610,1,0,3.0,1,0,4106,40.0,1.0,2
611,1,0,1.0,1,0,8072,253.0,1.0,1
612,1,0,2.0,1,0,7583,187.0,1.0,1
613,0,1,0.0,1,1,4583,133.0,0.0,3

In [121]:
y = dataset['Recruitment_Status']
y

0      Y
1      N
2      Y
3      Y
4      Y
      ..
609    Y
610    Y
611    Y
612    Y
613    N
Name: Recruitment_Status, Length: 614, dtype: object

In [122]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2)

In [123]:
#KNN
knnclassifier = KNeighborsClassifier(n_neighbors=6)
knnclassifier.fit(X_train, y_train)
print('The training accuracy is', knnclassifier.score(X_train,y_train))
print('The test accuracy is', knnclassifier.score(X_test,y_test))

The training accuracy is 0.7189409368635438
The test accuracy is 0.5609756097560976

In [124]:
#svm
svm = SVC(C=0.7)
svm.fit(X_train, y_train)
print('The training accuracy is', svm.score(X_train,y_train))
print('The test accuracy is', svm.score(X_test,y_test))

The training accuracy is 0.6863543788187373
The test accuracy is 0.6910569105691057

In [125]:
#decision tree
dt = DecisionTreeClassifier(max_depth=8)
dt.fit(X_train,y_train)
print('The training accuracy is', dt.score(X_train,y_train))
print('The test accuracy is', dt.score(X_test,y_test))

The training accuracy is 0.8757637474541752
The test accuracy is 0.7560975609756098

In [126]:
#random forest
rf = RandomForestClassifier(max_depth = 9)
rf.fit(X_train, y_train)
print('The training accuracy is', rf.score(X_train,y_train))
print('The test accuracy is', rf.score(X_test,y_test))

The training accuracy is 0.9266802443991853
The test accuracy is 0.8130081300813008

In [119]:
pickle.dump(rf, open('model2.pkl','wb'))